# Напишите класс MinMaxWordFinder. 
# Класс должен уметь анализировать текст и находить в нём слова наименьшей и наибольшей длины. 
# Текст состоит из предложений, которые добавляются в обработку методом add_sentence. 
# Метод shortest_words возвращает список самых коротких на данный момент слов, метод longest_words — самых длинных. 
# Слова, возвращаемые методами shortest_words и longest_words, должны быть отсортированы по алфавиту.
# Если одно из самых коротких слов встретилось в исходных предложениях несколько раз, оно должно столько же раз повториться в списке самых коротких слов. 
# Самые длинные слова наоборот должны входить в список без повторов.
